Repository: 84000/data-translation-memory
Catalog: toh145-v4.tmx
Source language: bo
Languages: en

source: །གང་དག་མི་སྐྱེ་བཟོད་པ་ཐོབ་གྱུར་པ།
en: Those who attain the forbearance of unborn factors

source: །འཇིག་རྟེན་སྒྲོན་ཏེ་རྒྱལ་བས་ལུང་བསྟན་ཏོ།
en: Are lamps of the world and prophesied by the Victor.

source: །འཇིག་རྟེན་སྒྲོན་གང་རྒྱལ་བས་ལུང་བསྟན་པ།
en: “ ‘Such lamps of the world that are prophesied by the Victor

source: །དེ་དག་རྒྱལ་བ་ཀུན་དང་མངོན་སུམ་གནས།
en: Dwell in the presence of all victors.

source: །རྒྱལ་བ་ཀུན་དང་མངོན་སུམ་སུ་གནས་པ།
en: Those who dwell in the presence of all victors

source: །དེ་དག་རྒྱལ་གསང་རྣམ་འཕྲུལ་ཆོ་ག་མཁས།
en: Will be skilled in the methods of magical displays of the secret victors.

source: །རྒྱལ་གསང་རྣམ་འཕྲུལ་ཆོ་ག་སུ་མཁས་པ།
en: “ ‘Those who are skilled in the methods of magical displays of the secret victors

source: །དེ་དག་རྒྱལ་བ་ཀུན་གྱིས་དགོངས་པ་ཡིན།
en: Will be thought of by all the victors.

source: །གང་དག་རྒྱལ་བ་ཀུན་གྱིས་དགོངས་གྱུར་པ།
en: Those who are thought of by all the victors

source: །དེ་དག་ཡོན་ཏན་ཀུན་གྱིས་ལེགས་པར་བརྒྱན།
en: Will be well ornamented by all good qualities.

source: །གང་དག་ཡོན་ཏན་ཀུན་གྱིས་ལེགས་བརྒྱན་པ།
en: “ ‘Those who are well ornamented by all good qualities—

source: །དེ་དག་བསོད་ནམས་དམ་པས་ལུས་ཀྱང་སྦྱངས།
en: Even their bodies will be purified by superior merit.

source: །བསོད་ནམས་མཆོག་གིས་གང་ལུས་རྣམ་སྦྱངས་པ།
en: Those who have bodies that are purified by superior merit

source: །དེ་དག་གསེར་གྱི་རི་བོ་འདྲ་བར་འབར།
en: Will glow like golden mountains.

source: །གསེར་གྱི་རི་བོ་འདྲ་བར་སུ་འབར་བ།
en: “ ‘Those who glow like golden mountains

source: །དེ་དག་སུམ་ཅུ་རྩ་གཉིས་མཚན་རྣམས་རྫོགས།
en: Will complete all thirty-two major marks.

source: །གང་དག་སུམ་ཅུ་རྩ་གཉིས་མཚན་རྫོགས་པ།
en: Those who complete all thirty-two major marks

source: །དེ་དག་ལུས་རྣམས་དཔེ་བྱད་བཟང་པོས་སྤྲས།
en: Will have bodies ornamented by the minor marks.

source: །གང་དག་ལུས་རྣམས་དཔེ་བྱད་བཟང་སྤྲས་པ།
en: “ ‘Those who have bodies ornamented by the minor marks

source: །དེ་དག་ལུས་ཀྱི་འོད་ནི་མཐའ་ཡས་སོ།
en: Will be limitless in their bodily light.

source: །གང་དག་ལུས་ཀྱི་འོད་ནི་མཐའ་ཡས་པ།
en: Those who are limitless in their bodily light

source: །དེ་དག་འོད་ཟེར་བཀོད་པ་བསམ་མི་ཁྱབ།
en: Will have unimaginably large arrays of light.

source: །གང་དག་འོད་བཀོད་བསམ་གྱིས་མི་ཁྱབ་པ།
en: “ ‘Those who have unimaginably large arrays of light

source: །དེ་དག་འོད་ལས་པད་མ་རྣམས་ཀྱང་འབྱུང་།
en: Will even have lotus flowers emerge from the light.

source: །གང་དག་འོད་ལས་པད་མ་རྣམས་བྱུང་བ།
en: Those for whom lotus flowers emerge from the light

source: །དེ་དག་རྒྱལ་གཟུགས་པད་མའི་གདན་འཁོད་པར། །ཕྱོགས་བཅུའི་འཇིག་རྟེན་དག་ཏུ་སྟོན་བྱེད་ཅིང་།
en: Can project in worlds in all ten directions As the body of the victor present on a lotus seat

source: །དོན་ཡོད་གནས་པ་སེམས་ཅན་འདུལ་བར་བྱེད།
en: And can discipline sentient beings who dwell in meaningful relations.

source: །གང་དག་རྒྱལ་གཟུགས་པད་མའི་གདན་འཁོད་པར། །ཕྱོགས་བཅུའི་འཇིག་རྟེན་དག་ཏུ་སྟོན་བྱེད་ཅིང་།
en: “ ‘Those who can project in worlds in all ten directions As the body of the victor present on a lotus seat

source: །དོན་ཡོད་གནས་པ་སེམས་ཅན་འདུལ་བྱེད་པ།
en: And can discipline sentient beings who dwell in meaningful relations

source: །དེ་དག་མངོན་ཤེས་རྣམ་འཕྲུལ་མཐའ་ཡས་སོ།
en: Will have infinite magical power of clairvoyance.

source: །གང་དག་མངོན་ཤེས་རྣམ་འཕྲུལ་མཐའ་ཡས་པ།
en: “ ‘Those who will have infinite magical power of clairvoyance

source: །དེ་དག་བསམ་གྱིས་མི་ཁྱབ་ཞིང་རྒྱུ་ཞིང་།
en: Will move through inconceivable buddhafields,

source: །བསམ་གྱིས་མི་ཁྱབ་ཆོས་རྣམས་སྟོན་པར་བྱེད།
en: Teach inconceivable Dharma teachings,

source: །སེམས་ཅན་བསམ་གྱིས་མི་ཁྱབ་ཚིམ་པར་བྱེད།
en: And satisfy inconceivably many sentient beings.

source: །གང་དག་བསམ་གྱིས་མི་ཁྱབ་ཆོས་སྟོན་ཅིང་།
en: “ ‘Those who will teach inconceivable Dharma teachings

source: །སེམས་ཅན་བསམ་གྱིས་མི་ཁྱབ་ཚིམ་བྱེད་པ།
en: And satisfy inconceivably many sentient beings

source: །དེ་དག་སོ་སོ་རིག་ཤེས་སྟོབས་རྣམས་ཀྱིས། །བསམ་པ་ཇི་བཞིན་འཇིག་རྟེན་སེམས་ཅན་འདུལ།
en: Will train the sentient beings in the world according to their individual minds Thanks to the power of the analytical knowledges.

source: །གང་དག་སོ་སོར་རིག་ཤེས་སྟོབས་རྣམས་ཀྱིས། །བསམ་པ་ཇི་བཞིན་འཇིག་རྟེན་སེམས་ཅན་འདུལ། །དེ་དག་རྟག་ཏུ་ལུས་དང་ངག་དང་ཡིད། །ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་རྗེས་སུ་འབྲང་། །
en: “ ‘Those who will train the sentient beings in the world according to their individual minds Thanks to the power of the analytical knowledges Will constantly, in their body, speech, and mind, Be preceded by gnosis and followed by gnosis.

source: གང་དག་རྟག་ཏུ་ལུས་དང་ངག་དང་ཡིད། །ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་རྗེས་འབྲང་བ། །དེ་དག་སྨོན་ལམ་སྟོབས་ཀྱིས་ཅི་འདོད་པར། །སེམས་ཅན་རྒྱུད་ན་གཟུགས་ནི་སྟོན་པར་བྱེད།
en: “ ‘Those who are constantly, in their body, speech, and mind, Preceded by gnosis and followed by gnosis Will reveal bodily forms in the minds of sentient beings According to their wishes through the power of former aspirations.

source: །གང་དག་སྨོན་ལམ་སྟོབས་ཀྱིས་ཅི་འདོད་པར། །སེམས་ཅན་རྒྱུད་ན་གཟུགས་ནི་སྟོན་བྱེད་པ།
en: “ ‘Those who reveal bodily forms in the minds of sentient beings According to their wishes through the power of former aspirations

source: །དེ་དག་ཚིག་རྣམས་རྗོད་པར་བྱེད་པའི་ཚེ།
en: Will, when they utter words,

source: །དབྱངས་ཀྱི་ཡན་ལག་བསམ་ཡས་སྒྲ་འབྱུང་ངོ་།
en: Produce inconceivable varieties of melody.

source: །གང་དག་ཚིག་རྣམས་རྗོད་པར་བྱེད་པའི་ཚེ། །དབྱངས་ཀྱི་ཡན་ལག་བསམ་ཡས་སྒྲ་འབྱུང་བ། །དེ་དག་འགྲོ་བ་མ་ལུས་ཀུན་གྱི་སེམས། །སྐད་ཅིག་གཅིག་ལ་སེམས་ཀྱིས་རྣམ་པར་ཤེས།
en: “ ‘Those who, when they utter words, Produce inconceivable varieties of melody Will perceive in one moment The minds of all sentient beings.

source: །གང་དག་འགྲོ་བ་མ་ལུས་ཀུན་གྱི་སེམས། །སྐད་ཅིག་གཅིག་ལ་སེམས་ཀྱིས་རྣམ་ཤེས་པ།
en: “ ‘Those who perceive in one moment The minds of all sentient beings

source: །དེ་དག་ནམ་ཡང་མི་འཆི་སྐྱེ་མི་འགྱུར། །ཉོན་མོངས་རྒྱུ་བའང་འབྱུང་བར་འགྱུར་མ་ཡིན།
en: Will never die and will not be reborn, And for them the flux of the defilements will not arise.

source: །གང་དག་ནམ་ཡང་མི་འཆི་མི་སྐྱེ་ཞིང་། །ཉོན་མོངས་རྒྱུ་བའང་འབྱུང་བར་མི་འགྱུར་བ།
en: “ ‘Those who never die and will not be reborn And for whom the flux of the defilements does not arise

source: །དེ་དག་ཡོན་ཏན་ཆོས་ཉིད་ཡེ་ཤེས་ལུས། །ཆོས་ཀྱིས་རབ་ཏུ་ཕྱེ་བས་འཇིག་རྟེན་རྒྱུ།
en: Will pass through the world, their bodies of gnosis Differentiated by the Dharma, their quality being reality.

source: །གང་དག་ཡོན་ཏན་ཆོས་ཉིད་ཡེ་ཤེས་ལུས། །ཆོས་ཀྱིས་རབ་ཕྱེ་འཇིག་རྟེན་རྒྱུ་བྱེད་པ།
en: “ ‘Those who pass through the world, their bodies of gnosis Differentiated by the Dharma, their quality being reality,

source: །དེ་དག་ས་བཅུ་རྣམས་དང་དབང་བཅུ་དང་། །ཕ་རོལ་ཕྱིན་དང་རྣམ་ཐར་མཆོག་ལ་གནས།
en: Will dwell in the ten levels, the ten powers, The perfections, and the highest emancipations.

source: །གང་དག་ས་བཅུ་རྣམས་དང་དབང་བཅུ་དང་། །ཕ་རོལ་ཕྱིན་དང་རྣམ་ཐར་མཆོག་གནས་པ།
en: “ ‘Those who will dwell in the ten levels, the ten powers, The perfections, and the highest emancipations

source: །དེ་དག་དབང་བསྐུར་བཀོད་དང་རྣམ་འཕྲུལ་དང་། །ཏིང་འཛིན་མཆོག་ལ་གནས་པ་རྗེས་སུ་འཐོབ།
en: Will attain the array of being consecrated and magical displays And will dwell in the highest absorptions.

source: །གང་དག་དབང་བསྐུར་བཀོད་དང་རྣམ་འཕྲུལ་དང་། །ཏིང་འཛིན་མཆོག་ལ་གནས་པ་རྗེས་ཐོབ་པ། །དེ་དག་ཕྱོགས་བཅུའི་རྒྱལ་བ་ཐམས་ཅད་ལས། །དབང་བསྐུར་ཐམས་ཅད་མ་ལུས་ནོད་པར་བྱེད།
en: “ ‘Those who attain the array of being consecrated and magical displays And who dwell in the highest absorptions Will attain all ways of being consecrated without exception From all the victors in the ten directions.

source: །གང་དག་ཕྱོགས་བཅུའི་རྒྱལ་བ་ཐམས་ཅད་ལས། །དབང་བསྐུར་ཐམས་ཅད་མ་ལུས་ནོད་བྱེད་པ།
en: “ ‘Those who attain all ways of being anointed without exception From all the victors in the ten directions

source: །དེ་དག་སྤྱི་བོར་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱིས། །ཕྱག་མཐིལ་བདུད་རྩི་ཅན་གྱིས་དབང་བསྐུར་ཏོ།
en: Will be anointed on their heads by the buddhas of the ten directions Whose palms are filled with the nectar of immortality.

source: །གང་དག་སྤྱི་བོར་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱིས། །ཕྱག་མཐིལ་བདུད་རྩི་ཅན་གྱིས་དབང་བསྐུར་བ།
en: “ ‘Those who are anointed on their heads by the buddhas of the ten directions Whose palms are filled with nectar or immortality—

source: མཐུ་བརྟན་དེ་དག་ནམ་མཁའ་ལྟ་བུར་ནི། །མ་ལུས་ཁྱབ་བྱས་ཕྱོགས་རྣམས་ཀུན་ན་གནས།
en: Such great beings with firm powers, after pervading everywhere like space, Will dwell in all directions.

source: །མཐུ་བརྟན་གང་དག་ནམ་མཁའ་ལྟ་བུར་ནི། །མ་ལུས་ཁྱབ་བྱས་ཕྱོགས་རྣམས་ཀུན་གནས་པ།
en: “ ‘Those who have firm powers and, after pervading everywhere like space, Dwell in all directions—

source: །མཚུངས་མེད་དེ་དག་སྤྱོད་ཡུལ་ལྷར་བཅས་ཀྱི། །འཇིག་རྟེན་རྣམས་ཀྱིས་ཤེས་པར་ཡོང་མི་ནུས།
en: The spheres of experience of those incomparable ones Will be impossible for the world with its gods to understand.

source: །མཚུངས་མེད་གང་དག་སྤྱོད་ཡུལ་ལྷར་བཅས་ཀྱི། །འཇིག་རྟེན་རྣམས་ཀྱིས་ཤེས་པར་མི་ནུས་པ།
en: “ ‘Those incomparable ones who have spheres of experience that are Impossible for the world with its gods to understand—

source: །དེ་དག་རྟུན་པ་ཀུན་དང་མཐོང་བ་དང་། །མིང་ཐོས་པ་དང་སྤོབས་པ་དོན་ཡོད་དོ།
en: All their efforts, their presence, their renown, And their eloquence will be meaningful.

source: །གང་དག་རྟུན་པ་ཀུན་དང་མཐོང་བ་དང་། །མིང་ཐོས་པ་དང་སྤོབས་པ་དོན་ཡོད་པ།
en: “ ‘Those whose efforts, presence, renown, And eloquence are meaningful—

source: །སྐྱེས་ཆེན་དེ་དག་སྦྱིན་པ་སྦྱིན་བྱེད་ཀྱི། །སྦྱིན་པ་ཐམས་ཅད་དོན་ཡོད་འགྱུར་བ་ཡིན།
en: For such great beings all their acts of charity, Consisting in deeds of generosity, will be meaningful.

source: །སྐྱེས་བུ་དམ་པ་དེ་དག་རྣམས་ཀྱི་མཐུས།།ཆོས་ཀྱང་གནས་ཤིང་བྱམས་པ་ཉམས་མི་འགྱུར།
en: “ ‘By the power of such beings, the Dharma too will endure, And kindness will not decline.

source: །དགེ་བའི་ལས་རྣམས་རབ་ཏུ་སྤྱོད་འགྱུར་ཏེ།
en: They will practice meritorious deeds,

source: །དཀོན་མཆོག་མཐུ་ཡང་དམ་པ་མཆོག་ཏུ་འགྱུར།
en: And the power of the noble Three Jewels will become supreme.

source: །རྡོ་རྗེ་མཁྲེགས་པའི་རིན་ཆེན་མཆོག་ཡོད་པ། །དེ་ཡི་མཐུ་ཡིས་རྒྱ་མཚོར་རིན་ཆེན་རྣམས།
en: “ ‘By the power of these beings, the jewels that are in the ocean, Including the best of jewels, the adamantine vajra,

source: །མི་ཟད་མི་འགྲིབ་འཕེལ་བར་མི་འགྱུར་ཏེ།
en: Will never become depleted or obscured,

source: །དེ་བཞིན་ཡོན་ཏན་མཐའ་ཡས་ཡོན་ཏན་ཆུ།
en: Just like water with limitless qualities.

source: །གང་ན་སངས་རྒྱས་མེད་པའི་ཞིང་གྱུར་པ།
en: “ ‘Wherever there are lands without buddhas,

source: །དེ་ནི་བྱང་ཆུབ་རྣམ་པར་སངས་རྒྱས་སྟོན།
en: They will manifest the complete awakening of buddhahood.

source: །ཕྱོགས་རྣམས་གང་ན་ཆོས་ཀྱང་མེད་གྱུར་པ།
en: In whatever direction there is likewise no Dharma,

source: །ཕྱོགས་དེར་ཆོས་ཀྱི་གཏེར་ནི་སྟོན་པར་བྱེད།
en: They will manifest a treasure of Dharma,

source: །དེ་དག་རྟོག་མེད་རྣམ་པར་མི་རྟོག་ཅིང་།
en: “ ‘They are without conceptualizing, nonconceptual,

source: །དེ་དག་ལྷུན་གྱིས་གྲུབ་པར་ཕྱོགས་ཀུན་དུ།
en: And they manifest spontaneously in all directions,

source: །ཟླ་བ་ལྟ་བུར་སྣང་བར་རབ་སྟོན་ཅིང་།
en: Illumining like the moon.

source: །ཐབས་སྟོང་དག་གིས་སེམས་ཅན་འདུལ་བར་བྱེད།
en: They train sentient beings in a thousand ways.

source: །དེ་དག་སྐད་ཅིག་རེ་ལ་ཕྱོགས་བཅུ་ཡི། །འཇིག་རྟེན་ཀུན་དུ་བྱང་ཆུབ་སངས་རྒྱས་སྟོན།
en: “ ‘Every moment they manifest the awakening of buddhahood In all ten directions of the world systems.

source: །འཁོར་ལོ་བསྐོར་དང་མྱ་ངན་འདས་ཞི་དང་། །རིང་བསྲེལ་རབ་ཏུ་རྒྱས་པའང་དཔའ་བོ་སྟོན།
en: They manifest the Valiant One by turning the wheel of Dharma, By the peace of nirvāṇa, and by leaving behind ample relics.

source: །མཁས་པ་དེ་དག་ཉན་ཐོས་རང་རྒྱལ་ས། །སངས་རྒྱས་བཀོད་པ་རྣམ་འཕྲུལ་མཐའ་ཡས་པ། །བསྐལ་པ་བསམ་མི་ཁྱབ་པར་སྟོན་བྱེད་ཅིང་། །ཐེག་གསུམ་སྒོ་ནས་སེམས་ཅན་འདུལ་བར་བྱེད།
en: “ ‘Manifesting, for inconceivable eons, the levels of śrāvakas and pratyekabuddhas And the infinite magical displays of the array of buddhas, Those expert ones train sentient beings By means of the Three Vehicles.

source: །མོས་པ་ཀུན་གྱི་བསྒྲུབ་པ་ཤེས་པ་རྣམས།
en: “ ‘Those who know about fulfilling all wishes

source: །ཁྱེའུ་དང་བུ་མོ་བུད་མེད་ལུས་རྣམས་དང་། །ལྷ་མི་ལྷ་མིན་ཀླུ་དང་གནོད་སྦྱིན་དང་། །གྲུལ་བུམ་ལྟོ་འཕྱེ་ཆེན་པོའི་གཟུགས་རྣམས་སྟོན།
en: Manifest the bodies of boys, girls, women, Gods, humans, asuras, nāgas, Yakṣas, kumbhāṇḍa evil spirits, and mahoragas.

source: །རྒྱ་མཚོའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་གྱི་སྒོས།
en: “ ‘By the absorption of the mudrā of the ocean,

source: །དཔའ་པོ་དེ་དག་འགྲོ་བའི་གཟུགས་སྤྱོད་དང་། །རྟགས་དང་སྤྱོད་དང་སྒྲ་སྐད་འཇུག་པ་དག །ཇི་སྙེད་ཐམས་ཅད་མ་ལུས་སྟོན་པར་བྱེད།
en: Those heroes manifest without omission The physical conduct, signs, behaviors, And language systems of living beings.

source: །དེ་དག་ཞིང་བཀོད་བསམ་གྱིས་མི་ཁྱབ་པས།
en: Through inconceivable pure land arrays

source: །ཕྱོགས་བཅུའི་རྒྱལ་བ་ཀུན་ལ་མཆོད་པར་བྱེད།
en: They worship all the victors of the ten directions.

source: །གང་དག་ཞིང་བཀོད་བསམ་གྱིས་མི་ཁྱབ་པས།
en: “ ‘Those who through inconceivable pure land arrays

source: །ཕྱོགས་བཅུའི་རྒྱལ་བ་ཀུན་ལ་མཆོད་བྱེད་པ།
en: Worship all the victors of the ten directions

source: །དེ་དག་འོད་ཟེར་བཀོད་པ་བསམ་ཡས་ཤིང་།
en: Manifest inconceivable arrays of light

source: །སེམས་ཅན་འགྲེལ་པའི་ཡེ་ཤེས་མཐའ་ཡས་སོ།
en: And the inconceivable gnosis of explaining things to sentient beings.

source: །གང་དག་འོད་ཟེར་བཀོད་པ་བསམ་ཡས་ཤིང་།
en: “ ‘Those who manifest inconceivable arrays of light

source: །སེམས་ཅན་འགྲེལ་པའི་ཡེ་ཤེས་བསམ་ཡས་པ།
en: And inconceivable gnosis of explaining things to sentient beings

source: །དེ་དག་ལུས་དང་ངག་གི་རྣམ་འཕྲུལ་དང་། །ཡིད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་བསམ་མི་ཁྱབ།
en: Manifest magical manifestations of body and speech And inconceivable manifestations of mind.

source: །གང་དག་ལུས་དང་ངག་གི་རྣམ་འཕྲུལ་དང་། །ཡིད་ཀྱི་རྣམ་འཕྲུལ་བསམ་གྱིས་མི་ཁྱབ་པ།
en: “ ‘Those who manifest magical manifestations of body and speech And inconceivable manifestations of mind

source: །དེ་དག་སྦྱིན་དང་ཚུལ་ཁྲིམས་རྣམ་འཕྲུལ་དང་། །བཟོད་དང་བརྩོན་འགྲུས་རྣམ་འཕྲུལ་བསམ་མི་ཁྱབ།
en: Manifest magical displays of giving and moral conduct And inconceivable magical displays of patience and vigor.

source: །གང་དག་སྦྱིན་དང་ཚུལ་ཁྲིམས་རྣམ་འཕྲུལ་དང་། །བཟོད་བརྩོན་རྣམ་འཕྲུལ་བསམ་གྱིས་མི་ཁྱབ་པ།
en: “ ‘Those who manifest magical displays of giving and moral conduct And inconceivable magical displays of patience and vigor

source: །དེ་དག་སངས་རྒྱས་ཕལ་ཆེན་ཏིང་འཛིན་སྒོས།
en: Will, through the absorption called buddha multitudes,

source: །བསམ་གཏན་རྣམ་པར་འཕྲུལ་དང་ཤེས་རབ་དང་། །ཐབས་དང་མངོན་ཤེས་རྣམ་འཕྲུལ་བསམ་མི་ཁྱབ།
en: Produce inconceivable magical displays of concentration And inconceivable magical displays of discriminating wisdom, means, and clairvoyance.

source: །ཡོན་ཏན་ཀུན་གྱི་རྣམ་འཕྲུལ་མཐའ་ཡང་ཡས།
en: Their magical displays of all good qualities will also be infinite.

source: །དེ་དག་ཕྲ་རབ་རྡུལ་འཇུག་ཏིང་ངེ་འཛིན།
en: “ ‘Through a meditative absorption that manifests minute atoms,

source: །རྡུལ་རྣམས་ཀུན་ལ་མངོན་པར་སྒྲུབ་བྱེད་ཅིང་།
en: They achieve that for all atoms,

source: །རྡུལ་གཅིག་སྟེང་ན་ཞིང་རྣམས་བསམ་མི་ཁྱབ།
en: And display in a single atom inconceivably many buddhafields;

source: །སྟོན་པར་བྱེད་ཀྱང་རྡུལ་ལ་འཕེལ་བ་མེད།
en: But even so, that single atom does not increase.

source: །རྡུལ་དེའི་སྟེང་ན་སངས་རྒྱས་བཅས་ཞིང་དང་། །སངས་རྒྱས་མེད་པའི་ཞིང་ཡང་ཁ་ཅིག་སྟོན།
en: “ ‘Within a single atom, they display buddhafields with buddhas, And some of those fields lack buddhas.

source: །ཉོན་མོངས་རྣམ་དག་དོག་པ་ཁ་ཅིག་དང་། །ཡངས་ཤིང་ཕྲ་དང་ཆེ་བའི་ཞིང་ཡང་སྟོན།
en: They also display a few flower clusters of purified defilements And fields that are vast and limited or extensive in scope.

source: །ཞིང་རྣམས་ལ་ལ་འཇིག་དང་འཆགས་པ་དང་། །ལ་ལ་སྤྱིའུ་ཚུགས་གྱུར་དང་འཐུན་པ་དང་། །ལ་ལ་སྣྲེལ་ཞི་སྨིག་རྒྱུ་ལྟ་བུ་དང་། །ལ་ལ་མིག་འཕྲུལ་ལྟ་བུར་གྱུར་པ་རྣམས།
en: “ ‘Some of those fields are destroyed, some remain established, Some seem to be standing upside down, Some seem to be in reverse or like a mirage, And some appear like a conjuring trick.

source: །ཇི་ལྟར་རྡུལ་གཅིག་སྟེང་དུ་སྟོན་བྱེད་པ།
en: “ ‘Just as the buddhafields are displayed in a single atom,

source: །དེ་བཞིན་རྡུལ་རྣམས་མ་ལུས་ཀུན་ལ་སྟོན།
en: So they appear in all of them.

source: །དྲང་སྲོང་ཏིང་འཛིན་རྣམ་འཕྲུལ་འདི་འདྲ་སྟེ།
en: Such is the magical display of the absorption of the seers.

source: །གྲགས་པ་མཐའ་ཡས་རྣམ་ཐར་འདི་འདྲའོ།
en: Such is their liberation of limitless renown.

source: །དེ་དག་རྒྱལ་མཆོད་རྣམ་འཕྲུལ་ཏིང་ངེ་འཛིན། །རྒྱལ་བ་ཀུན་ལ་མངོན་པར་སྒྲུབ་བྱེད་ཅིང་།
en: “ ‘They make manifest for all victors the absorption, The magical display of offerings to the victors.

source: །ལག་པའི་མཐིལ་དུ་སྟོང་གསུམ་རྒྱས་བཀང་སྟེ།
en: Filling the palms of their hands with the billionfold world systems,

source: །སྐྱེས་བུ་ཆེན་པོ་རྣམས་ལ་མཆོད་པ་བྱེད།
en: They worship the sublime beings.

source: །ཕྱོགས་བཅུ་དག་ན་མེ་ཏོག་ཕྲེང་བ་དང་།
en: “ ‘As many garlands of flowers as there are in all ten directions,

source: །སྤོས་བྱུག་རིན་ཆེན་རིན་ཆེ་ཇི་སྙེད་པ།
en: And as many precious fragrances, scented powders, and jewels—

source: །དེ་དག་བྱང་ཆུབ་ཤིང་དྲུང་བཞུགས་པ་ཡི། །རྒྱལ་རྣམས་མཆོད་ཕྱིར་ལག་པའི་མཐིལ་ནས་འབྱིན།
en: All those they emit from the palms of their hands to worship the victors Who dwell at the foot of the tree of awakening.

source: །གོས་དང་ཕྱེ་མ་རིན་ཆེན་ཇི་སྙེད་དང་། །རྒྱལ་མཚན་བ་དན་གདུགས་མཆོག་སྣ་ཚོགས་དང་། །གསེར་གྱིས་བརྒྱན་པའི་རིན་ཆེན་བླ་རེ་རྣམས། །དེ་དག་ལག་པའི་མཐིལ་ནས་ཆར་དུ་འབེབས། །
en: “ ‘As many precious silk textiles, scented powders, jewels, Victory banners, flags, varieties of the best parasols, And gold-ornamented jewel canopies as there are— All of these are showered down from the palms of their hands.

source: ཕྱོགས་བཅུ་དག་ན་ཡོ་བྱད་མཐའ་ཡས་གང་། །དྲང་སྲོང་ཆེན་པོ་རྣམས་ལ་མཆོད་འོས་པ། །དེ་དག་ལག་པའི་མཐིལ་ནས་ཆར་འབེབས་ཤིང་། །བྱང་ཆུབ་ཤིང་དྲུང་བཞུགས་པའི་རྒྱལ་བ་མཆོད།
en: “ ‘And showering down from the palms of their hands Infinite necessities in the ten directions, Which are worthy of being offered to the great seers, They worship the victors who dwell beneath the tree of awakening.

source: །ཕྱོགས་རྣམས་དག་ན་རོལ་མོ་ཇི་སྙེད་པ། །རྔ་དང་རྫ་རྔ་སྒྲ་སྙན་པི་བང་དང་། །སིལ་སྙན་སྒྲ་དང་སྒྲ་ཆེན་གླིང་བུ་རྣམས། །དེ་དག་ལག་པའི་མཐིལ་ནས་རབ་ཏུ་སྒྲོགས།
en: “ ‘All of the music that exists in the ten directions—Played on drums, clay pot drums, lutes, vīṇās, Small and large cymbals, or flutes— They sound forth from the palms of their hands.

source: །ཕྱོགས་བཅུ་ཀུན་གྱི་དཔེ་ཟླ་མེད་རྣམས་ཀྱི། །ཡང་དག་ཡོན་ཏན་བསྔགས་པ་སྣ་ཚོགས་དང་། །བསྟོད་པའི་ཚིགས་བཅད་སྒྲུབ་པ་སྣ་ཚོགས་པ། །དེ་དག་ལག་པའི་མཐིལ་ནས་རབ་ཏུ་སྒྲོགས།
en: “ ‘They also utter from the palms of their hands The various praises of the true qualities In all ten directions using incomparable examples And various formulations of eulogistic verses.

source: །འོད་ཟེར་གང་དག་ལས་དགེས་ཡོངས་བསགས་པ། །ལག་པ་གཡས་ནས་ཡོངས་སུ་འགྱེད་བྱེད་ཅིང་། །སྤོས་ཆུས་རྒྱལ་བའི་ཞིང་རྣམས་ཐམས་ཅད་དུ། །འབེབས་ཤིང་འཇིག་རྟེན་སྒྲོན་མ་རྣམས་ལ་མཆོད།
en: “ ‘Radiating from their right hands Light rays that gather through the power of meritorious acts, They release a shower of scented water over all the Buddhafields And worship the lamps of the world.

source: །འོད་ཟེར་བཀོད་དང་ལྡན་པ་མཛེས་པའི་འོད། །པད་མའི་རྒྱན་ཕྲེང་བསམ་ཡས་རབ་འཕྱང་བ། །པད་མ་མཚན་རབ་གཟུགས་ཅན་དུ་མ་དག །ལག་ནས་རྒྱལ་བ་རྣམས་ལ་མཆོད་པར་བྱེད།
en: “ ‘They worship the victors from their hands Through numerous light rays with arrays and beautiful lights And draped with inconceivable ornamental garlands of lotuses, Which assume the forms of exquisite lotuses.

source: །མེ་ཏོག་ཕལ་ཆེན་མེ་ཏོག་བླ་རེ་དང་། །མེ་ཏོག་བཀོད་པའི་འོད་ཟེར་རབ་བཀྱེ་སྟེ། །མེ་ཏོག་སྣ་ཚོགས་ཀུན་དུ་བཀྲམ་བྱས་ཤིང་། །
en: “ ‘Emanating multitudes of flowers, Flower canopies, and light rays in the shape of flowers, And having strewn about various flowers,

source: བདག་ཉིད་ཆེན་པོ་དེ་དག་རྒྱལ་བ་མཆོད། །
en: Those great beings worship the Victor.

source: བདུག་པ་ཕལ་ཆེན་བདུག་པའི་བླ་རེ་དང་། །བདུག་པ་བཀོད་པའི་འོད་ཟེར་རབ་བཀྱེ་སྟེ། །བདུག་པ་སྣ་ཚོགས་ཀུན་དུ་བཀྲམ་བྱས་ཤིང་།
en: “ ‘Emanating multitudes of incense, Incense canopies, and light rays in the shape of incense, And having strewn about various kinds of incense,

source: །བདག་ཉིད་ཆེན་པོ་དེ་དག་རྒྱལ་བ་མཆོད།
en: Those great beings worship the Victor.

source: །ཕལ་ཆེན་སྤོས་དང་སྤོས་ཀྱི་བླ་རེ་དང་། །སྤོས་ཀྱིས་བཀོད་པའི་འོད་ཟེར་རབ་བཀྱེ་སྟེ། །སྣ་ཚོགས་སྤོས་རྣམས་ཀུན་དུ་བཀྲམ་བྱས་ཤིང་།
en: “ ‘Emanating multitudes of fragrances, Fragrance canopies, and light rays in the shape of fragrant substances, And having strewn about various kinds of fragrances,

source: །ཕྲེང་བ་ཕལ་ཆེན་ཕྲེང་བའི་བླ་རེ་དང་། །ཕྲེང་བ་བཀོད་པའི་འོད་ཟེར་རབ་བཀྱེ་སྟེ།
en: “ ‘Emanating multitudes of garlands, Garland canopies, and light rays in the shape of garlands,

source: །ཕྲེང་བ་སྣ་ཚོགས་ཀུན་དུ་བཀྲམ་བྱས་ཤིང་།
en: And having strewn about various garlands,

source: །ཕྱེ་མ་ཕལ་ཆེན་ཕྱེ་མའི་བླ་རེ་དང་། །ཕྱེ་མ་བཀོད་པའི་འོད་ཟེར་རབ་བཀྱེ་སྟེ།
en: “ ‘Emanating multitudes of incense powder, Incense powder canopies, and light rays in the shape of incense powder,

source: །ཕྱེ་མ་སྣ་ཚོགས་ཀུན་དུ་བཀྲམ་བྱས་ཤིང་།
en: And having strewn about various incense powders,

source: །ན་བཟའ་ཕལ་ཆེན་ན་བཟའི་བླ་རེ་དང་། །ན་བཟའ་བཀོད་པའི་འོད་ཟེར་རབ་བཀྱེ་སྟེ།
en: “ ‘Emanating multitudes of textiles, Textile canopies, and light rays in the shape of textiles,

source: །ན་བཟའ་སྣ་ཚོགས་ཀུན་དུ་བཀྲམ་བྱས་ཤིང་།
en: And having strewn about various textiles,

source: །ཕལ་ཆེན་གདུགས་དང་གདུགས་ཀྱི་བླ་རེ་དང་། །གདུགས་ཀྱི་བཀོད་པའི་འོད་ཟེར་རབ་བཀྱེ་སྟེ།
en: “ ‘Emanating multitudes of parasols, Parasol canopies, and light rays in the shape of parasols,

source: །སྣ་ཚོགས་གདུགས་རྣམས་ཀུན་དུ་བཀྲམ་བྱས་ཤིང་།
en: And having strewn about various parasols,

source: །རིན་ཆེན་ཕལ་ཆེན་རིན་ཆེན་བླ་རེ་དང་། །རིན་ཆེན་བཀོད་པའི་འོད་ཟེར་རབ་བཀྱེ་སྟེ།
en: “ ‘Emanating multitudes of jewels, Jewel canopies, and light rays in the shape of jewels,

source: །རིན་ཆེན་སྣ་ཚོགས་ཀུན་དུ་བཀྲམ་བྱས་ཤིང་།
en: And having strewn about various jewels,

source: །པད་མ་ཕལ་ཆེན་པད་མའི་བླ་རེ་དང་། །པད་མ་བཀོད་པའི་འོད་ཟེར་རབ་བཀྱེ་སྟེ།
en: “ ‘Emanating multitudes of lotuses, Lotus canopies, and light rays in the shape of lotuses,

source: །པད་མ་སྣ་ཚོགས་ཀུན་དུ་བཀྲམ་བྱས་ཤིང་།
en: And having strewn about various lotuses,

source: །རྒྱན་ཕྲེང་ཕལ་ཆེན་རྒྱན་ཕྲེང་བླ་རེ་དང་། །རྒྱན་ཕྲེང་བཀོད་པའི་འོད་ཟེར་རབ་བཀྱེ་སྟེ།
en: “ ‘Emanating multitudes of necklaces, Necklace canopies, and light rays in the shape of necklaces,

source: །རྒྱན་ཕྲེང་སྣ་ཚོགས་ཀུན་དུ་བཀྲམ་བྱས་ཤིང་།
en: And having strewn about various necklaces,

source: །རྒྱལ་མཚན་མཆོག་བཀོད་འོད་ཟེར་རབ་བཀྱེ་ཞིང་།
en: “ ‘They will emanate light in the shape of the best of victory banners,

source: །དེ་དག་རྒྱལ་མཚན་དཀར་དམར་སེར་པོ་དང་། །སྔོ་དང་རྒྱལ་མཚན་བཀོད་པ་སྣ་ཚོགས་པ། །དུ་མས་རྒྱལ་བའི་ཞིང་རྣམས་བརྒྱན་པར་བྱེད།
en: And using banners that are white, yellow, red, And blue, and with numerous banners of various shapes, They ornament the buddhafields of the Victor.

source: །ནོར་བུ་འདྲ་བ་སྣ་ཚོགས་བཀོད་པའི་གདུགས།
en: “ ‘And with parasols equipped with various nets of jewels,

source: །དར་གྱི་ལྡ་ལྡི་བ་དན་རབ་སྤྱངས་ཤིང་།
en: They have hung flags of silken strings,

source: །དྲིལ་གཡེར་དྲ་བ་རྒྱལ་བའི་གསུང་སྒྲོགས་པ།
en: And with chains of large and small bells that sound with the voice of the Victor,

source: །དེ་བཞིན་གཤེགས་པའི་དབུ་ལ་དེ་དག་འཛིན།
en: They attach those to the head of the Tathāgata.

source: །ལག་པའི་མཐིལ་ནས་མཆོད་པ་མཐའ་ཡས་རྣམས།
en: “ ‘And those infinite offerings from their hands—

source: །རྒྱལ་བ་གཅིག་ལ་དེ་དག་བྱེད་པ་ལྟར།
en: Just as they offer to a single victor,

source: །རྒྱལ་བ་མ་ལུས་ཀུན་ལའང་དེ་བཞིན་ཏེ།
en: So they offer to all victors without exception.

source: །དྲང་སྲོང་ཏིང་འཛིན་རྣམ་འཕྲུལ་དེ་འདྲའོ།
en: Such is the magical display of the absorption of seers.

source: །དེ་དག་འགྲོ་བ་སྡུད་པའི་ཡེ་ཤེས་ཀྱིས།
en: “ ‘By virtue of the gnosis that attracts living beings,

source: །རྣམ་པར་འཕྲུལ་དང་ཏིང་འཛིན་མཆོག་བསྒྲུབས་ཤིང་། །བྱ་བ་དག་དང་བསྙེན་བཀུར་ཀུན་གྱི་སྒོ། །ཐབས་སྟོང་དག་གིས་སེམས་ཅན་འདུལ་བར་བྱེད།
en: And by achieving the magical displays and highest absorptions, They train sentient beings through a thousand methods, Which is the medium of all duties and respectful service.
